<a href="https://colab.research.google.com/github/jonahcoutinho/Machine-Learning/blob/main/Decision_Tree.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
%matplotlib inline
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score,confusion_matrix
from sklearn.linear_model import LogisticRegression,LinearRegression

In [3]:
df=pd.read_csv('/content/salaries.csv')

In [4]:
df

       company                  job     degree  salary_more_then_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1

In [5]:
X=df.drop('salary_more_then_100k',axis='columns')

In [6]:
y=df.salary_more_then_100k

In [7]:
X

       company                  job     degree
0       google      sales executive  bachelors
1       google      sales executive    masters
2       google     business manager  bachelors
3       google     business manager    masters
4       google  computer programmer  bachelors
5       google  computer programmer    masters
6   abc pharma      sales executive    masters
7   abc pharma  computer programmer  bachelors
8   abc pharma     business manager  bachelors
9   abc pharma     business manager    masters
10    facebook      sales executive  bachelors
11    facebook      sales executive    masters
12    facebook     business manager  bachelors
13    facebook     business manager    masters
14    facebook  computer programmer  bachelors
15    facebook  computer programmer    masters

In [8]:
#coverts  to numbers

In [9]:
from sklearn.preprocessing import LabelEncoder

In [10]:
le_company=LabelEncoder()
le_job=LabelEncoder()
le_degree=LabelEncoder()

In [11]:
X['n_company']=le_company.fit_transform(X.company)
X['n_jobs']=le_job.fit_transform(X.job)
X['n_degree']=le_degree.fit_transform(X.degree)

In [12]:
X

       company                  job     degree  n_company  n_jobs  n_degree
0       google      sales executive  bachelors          2       2         0
1       google      sales executive    masters          2       2         1
2       google     business manager  bachelors          2       0         0
3       google     business manager    masters          2       0         1
4       google  computer programmer  bachelors          2       1         0
5       google  computer programmer    masters          2       1         1
6   abc pharma      sales executive    masters          0       2         1
7   abc pharma  computer programmer  bachelors          0       1         0
8   abc pharma     business manager  bachelors          0       0         0
9   abc pharma     business manager    masters          0       0         1
10    facebook      sales executive  bachelors          1       2         0
11    facebook      sales executive    masters          1       2         1
12    facebook     business manager  bachelors          1       0         0
13    facebook     business manager    masters          1       0         1
14    facebook  computer programmer  bachelors          1       1         0
15    facebook  computer programmer    masters          1       1         1

In [13]:
X_new=X.drop(['company','job','degree'],axis='columns')

In [14]:
X_new

    n_company  n_jobs  n_degree
0           2       2         0
1           2       2         1
2           2       0         0
3           2       0         1
4           2       1         0
5           2       1         1
6           0       2         1
7           0       1         0
8           0       0         0
9           0       0         1
10          1       2         0
11          1       2         1
12          1       0         0
13          1       0         1
14          1       1         0
15          1       1         1

In [15]:
y

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [16]:
from sklearn import tree

In [17]:
model=tree.DecisionTreeClassifier()

In [18]:
model.fit(X_new,y)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [19]:
model.score(X_new,y)

1.0